---
kind: type
id: T:Autodesk.Revit.DB.Lighting.PresetInitialColor
source: html/820a579a-c999-f721-0b9c-d98c499c2c1e.htm
---
# Autodesk.Revit.DB.Lighting.PresetInitialColor

This class encapsulates a preset initial lighting color.

## Syntax (C#)
```csharp
public class PresetInitialColor : InitialColor
```